{
  "contactDetails": {
    "name": "Mario Pereda",
    "title": "Software Engineer",
    "phoneNumber": "+49 1575 1916935",
    "gmailAddress": "mario.pereda.08@gmail.com",
    "livingAddress": "Stuttgart, Germany"
  },

  "experiences": [
    {
      "position": "Software Engineering Intern – Embedded Systems",
      "company": "Comlet GmbH, Zweibrücken, Germany",
      "date": "March 2024 - August 2024",
      "details": [
        "Developed a hardware testing automation tool for embedded systems using Robot Framework, enabling continuous, repeatable test execution without manual intervention.",
        "Programmed and optimized firmware for 3D printers using Marlin and OctoPrint; integrated TMC2209 stepper drivers for improved motion control.",
        "Designed and 3D-printed 8 functional hardware prototypes, including precision fixtures and mounts for embedded testing workflows.",
        "Implemented CI/CD pipelines to accelerate deployment cycles and maintain consistent software delivery across test environments."
      ]
    },
    {
      "position": "Software Engineering Intern – Web & Cloud",
      "company": "Evenbytes, Santander, Spain",
      "date": "February 2023 - August 2023",
      "details": [
        "Created a Gmail Add-on using Google Apps Script and OpenAI API for real-time invoice parsing and categorization, reducing manual workload.",
        "Built a cloud-native access control system deployed on Google Cloud Run with Firestore backend, scalable to 1,000+ users and multiple devices.",
        "Modernized internal tools, reducing development and setup time by 50% through system refactoring and automation.",
        "Improved backend scalability and API integration for seamless connection with various access control devices."
      ]
    },
    {
      "position": "Amazon Delivery Driver",
      "company": "PRB Logistik GmbH, Ramstein, Germany",
      "date": "October 2024 - December 2024",
      "details": [
        "Completed daily delivery routes with approximately 250 parcels, maintaining a 95% on-time rate and high customer satisfaction.",
        "Enhanced communication and German language skills through daily face-to-face customer interactions."
      ]
    }
  ],
  "projects": [
    {
      "title": "CAN and OBD Reader for BMW",
      "description": "Developed a real-time vehicle diagnostics tool using Python to monitor up to 6 CAN and OBD parameters simultaneously. Created a live data visualization dashboard with Angular and Node.js to assist in automotive fault detection."
    },
    {
      "title": "LogistiX: Factory Builder Unity Game",
      "description": "Built a 3D factory automation game in Unity using C#, implementing 11 crafting recipes and 3 production machines. Designed and textured 3D assets in Blender to ensure a cohesive and immersive gameplay experience."
    },
    {
      "title": "Dynamic CV Generator",
      "description": "Created a tool for efficiently customizing resumes to job descriptions streamlining CV tailoring for users. This CV PDF was generated using the tool, and a live demo is available on my GitHub page."
    }
  ],
  "education": {
    "degree": "Bachelor in Computer Science",
    "university": "University of Valladolid, Spain",
    "graduation_date": "August 2024"
  },
  "languages": [
    "English - Fluent",
    "German - Beginner (A2)",
    "Spanish - Native"
  ],
  "softSkills": [
    "Fast Learner",
    "Team Player",
    "Problem Solver",
    "Flexible",
    "Good Communication"
  ],
  "other": [
    "German Work Permit",
    "B Drivers License",
    "Available Now"
  ],
  "titles": {
    "experience":"Experience",
    "project": "Projects",
    "education": "Education",
    "languages": "Languages",
    "skills": "Skills",
    "other": "Other"
  }
}
